alefragnani.bookmarks
anthropic.claude-code
charliermarsh.ruff
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
golang.go
hashicorp.terraform
huggingface.huggingface-vscode-chat
jdinhlife.gruvbox
llvm-vs-code-extensions.lldb-dap
ms-azure-devops.azure-pipelines
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-ai
ms-toolsai.vscode-ai-remote
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.azurecli
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
ms-vscode.vscode-node-azure-pack
ms-windows-ai-studio.windows-ai-studio
openai.chatgpt
redhat.vscode-yaml
rust-lang.rust-analyzer
shopify.ruby-extensions-pack
shopify.ruby-lsp
sorbet.sorbet-vscode-extension
svelte.svelte-vscode
tamasfe.even-better-toml
vscodevim.vim
xaver.clang-format
ziglang.vscode-zig
